Blog.org
#+Title: Blog
#+Author: Mario Román
#+Email: mromang08@gmail.com
#+Date: 26 December 2019
#+Creator: <a href="https://mroman42.github.com">@mroman42</a>.
#+Options: toc:nil date:t num:nil html-style:nil html-postamble:t
#+export_file_name: docs/blog.html

* TODO Category theory and lambda calculus                                                    :post:
:PROPERTIES:
:TITLE: Category theory and lambda calculus
:EXPORT_FILE_NAME: categorytheoryandlambdacalculus.html
:INDEX_DATE: <2018-07-01 Sun 11:00>
:END:

*Category theory and lambda calculus* is the title of my bachelor's
thesis.  It discusses the implementation of [[./mikrokosmos.html][Mikrokosmos]] and
categorical semantics for the simply typed lambda calculus in its
first half. It later extends these notions to dependently typed
programming languages (Agda is used as an example) and locally closed
cartesian categories.  It must be seen as a summary of my study during
these months and as a literature review: there is no claim of
originality more than the way the ideas are presented.

The complete thesis was written with Emacs in [[https://orgmode.org/][org-mode format]] (highly
recommended) and the source code is publicly available [[https://github.com/mroman42/ctlc][at GitHub]]. The
final [[https://mroman42.github.io/ctlc/ctlc.pdf][PDF]] is also available, but if you are not that interested on the
details, you may prefer to simply read the [[https://mroman42.github.io/ctlc-slides/slides.pdf][commented slides]] (in
Spanish), which are a reasonable summary of the ideas presented there.

