categorytheoryandlambdacalculus.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-07-01 Sun 16:27 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Category theory and lambda calculus</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Mario Román" />
<link rel="stylesheet" href="default.css" />
<link rel="stylesheet" href="mathjax_fonts.css" />
<link rel="stylesheet" href="syntax.css" />
<div id="header">
<div id="logo">
<a href="index.html">Cosmoi</a>
</div>
<div id="navigation">
<a href="index.html">Index</a>
<a href="about.html">About</a>
</div>
</div>
</head>
<body>
<div id="content">
<h1 class="title">Category theory and lambda calculus</h1>
<p>
<b>Category theory and lambda calculus</b> is the title of my bachelor's
thesis.  It discusses the implementation of <a href="./mikrokosmos.html">Mikrokosmos</a> and
categorical semantics for the simply typed lambda calculus in its
first half. It later extends these notions to dependently typed
programming languages (Agda is used as an example) and locally closed
cartesian categories.  It must be seen as a summary of my study during
these months and as a literature review: there is no claim of
originality more than the way the ideas are presented.
</p>

<p>
The complete thesis was written with Emacs in <a href="https://orgmode.org/">org-mode format</a> (highly
recommended) and the source code is publicly available <a href="https://github.com/mroman42/ctlc">at GitHub</a>. The
final <a href="https://mroman42.github.io/ctlc/ctlc.pdf">PDF</a> is also available, but if you are not that interested on the
details, you may prefer to simply read the <a href="https://mroman42.github.io/ctlc-slides/slides.pdf">commented slides</a>, which are
a reasonable summary of the ideas presented there.
</p>
</div>
<div id="postamble" class="status">
<div id="footer"><p class="postamble">Last edited 2018-07-01 Sun 11:00. Written by <a href="https://mroman42.github.com">@mroman42</a>.</p></div>
</div>
</body>
</html>
